tap "homebrew/services"
# Shell extension to jump to frequently used directories
brew "autojump"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# App to build and share containerised applications and microservices
cask "docker"
# Control your tools with a few keystrokes
cask "raycast"
vscode "beardedbear.beardedtheme"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "harryhopkinson.vim-theme"
vscode "huytd.tokyo-city"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nord.nord"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "statelyai.stately-vscode"
vscode "tal7aouy.theme"
vscode "victor-gp.lucario-theme"
vscode "yamenarahman.nord-extra-dark"
vscode "zambam83.nord-theme"
